Revit 2026 API

# IFCFileReadOptionsXMLConfigFileName Property

---

The XML configuration file name. It is used only for reading IFC-XML format file.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string XMLConfigFileName { get; set; }
```
```vb
Public Property XMLConfigFileName As String
	Get
	Set
```
```cpp
public:
property String^ XMLConfigFileName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member XMLConfigFileName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

It uses default configuration if it is not set.

#### Reference

IFCFileReadOptions Class

Autodesk.Revit.DB.IFC Namespace